<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Slack and creates a package.</string>
	<key>Identifier</key>
	<string>com.ssva.pkg.Slack</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Slack</string>
		<key>PKG_ID</key>
		<string>com.tinyspeck.slackmacgap</string>
		<key>description</key>
		<string>Description</string>
		<key>developer</key>
		<string>Strategic Solutions</string>
		<key>display_name</key>
		<string>Slack</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.ssva.download.Slack</string>
	<key>Process</key>
	<array>
		<dict> 
	<key>Arguments</key> 
	<dict> 
		<key>pkgdirs</key> 
		<dict> 
			<key>Applications</key> 
			<string>0775</string> 
		</dict> 
		<key>pkgroot</key> 
		<string>%RECIPE_CACHE_DIR%/%NAME%</string> 
	</dict> 
	<key>Processor</key> 
	<string>PkgRootCreator</string> 
</dict> 

<dict> 
	<key>Arguments</key> 
	<dict> 
		<key>destination_path</key> 
		<string>%pkgroot%/Applications/Slack.app</string> 
		<key>source_path</key> 
		<string>%pathname%/Slack.app</string> 
	</dict> 
	<key>Processor</key> 
	<string>Copier</string> 
</dict> 
		
<dict> 
	<key>Arguments</key> 
	<dict> 
		<key>dmg_path</key> 
		<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string> 
	</dict> 
	<key>Processor</key> 
	<string>AppDmgVersioner</string> 
</dict> 
		
<dict> 
	<key>Arguments</key> 
	<dict> 
		<key>pkg_request</key> 
		<dict> 
			<key>chown</key> 
			<array> 
				<dict> 
					<key>group</key> 
					<string>admin</string> 
					<key>path</key> 
					<string>Applications</string> 
					<key>user</key> 
					<string>root</string> 
				</dict> 
			</array> 
			<key>id</key> 
			<string>com.tinyspeck.slackmacgap</string> 
			<key>options</key> 
			<string>purge_ds_store</string> 
			<key>pkgdir</key> 
			<string>%RECIPE_CACHE_DIR%/downloads</string> 
			<key>pkgname</key> 
			<string>%NAME%-%version%</string> 
		</dict> 
	</dict> 
	<key>Processor</key> 
	<string>PkgCreator</string> 
</dict> 

<dict> 
	<key>Arguments</key> 
	<dict> 
		<key>destination_path</key> 
		<string>%RECIPE_CACHE_DIR%/unpack</string> 
		<key>flat_pkg_path</key> 
		<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.pkg</string> 
	</dict> 
	<key>Processor</key> 
	<string>FlatPkgUnpacker</string> 
</dict> 

<dict> 
	<key>Arguments</key> 
	<dict> 
		<key>pattern</key> 
		<string>%destination_path%/*.pkg</string> 
	</dict> 
	<key>Processor</key> 
	<string>FileFinder</string> 
</dict> 

<dict> 
	<key>Arguments</key> 
	<dict> 
		<key>destination_path</key> 
		<string>%destination_path%</string> 
		<key>pkg_payload_path</key> 
		<string>%destination_path%/%found_basename%/Payload</string> 
	</dict> 
	<key>Processor</key> 
	<string>PkgPayloadUnpacker</string> 
</dict> 
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%destination_path%/Contents/Info.plist</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>bundleID</string>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%RECIPE_CACHE_DIR%/*.pkg</string>
				<key>bundleId</key>
				<string>%bundleID%</string>
				<key>bundleVersion</key>
				<string>%version%</string>
				<key>description</key>
				<string>%description%</string>
				<key>displayname</key>
				<string>%display_name%</string>
				<key>publisher</key>
				<string>%developer%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
		<string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
		</dict>
	</array>
</dict>
</plist>
